# Даны два словаря. Напишите программу, которая объединит эти словари. 
# Если ключи встречаются в обоих исходных словарях, значения, 
# которые хранятся по этим ключам складываются.
# Пример:

# Первый словарь: {'a': 100, 'b': 200, 'c':300}
# Второй словарь: {'a': 300, 'b': 200, 'd':400}
# Результат: {'a': 400, 'b': 400, 'd': 400, 'c': 300}
a={'a': 100, 'b': 200, 'c':300}
b={'a': 300, 'b': 200, 'd':400}
l={}
l=b.copy()
for i in a:
    if i in l:
        l[i]+=a[i]
    else:
        l[i]=a[i]
s=""
for i in l:
    s += i + ": " + str(l[i]) + ", "
print(s)